{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "ControlNetModel",
    "parent_library": "diffusers.models.controlnet"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "conv1",
    "time_emb_proj",
    "proj",
    "linear_2",
    "conv_shortcut",
    "conv_out",
    "conv",
    "to_k",
    "to_v",
    "proj_in",
    "proj_out",
    "conv2",
    "conv_in",
    "to_q",
    "controlnet_mid_block",
    "linear_1"
  ],
  "task_type": null
}